Heat_Transfer/BuoyantSimpleFOAM/buoyantCavity/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication $(getApplication)
runApplication -s sample  postProcess -latestTime -func sample

if notTest $@
then
    runApplication validation/createGraphs
fi

#------------------------------------------------------------------------------
